Autodesk.Revit.DB.DisplayStyle
Display type of the view.
Since:
2013

Autodesk.Revit.DB.DisplayStyle.Raytrace
Raytrace.
Because setting a view's display style to raytrace enters a special restricted mode with limited capabilities,
it is not permitted to directly assign the display style to this value.

Autodesk.Revit.DB.DisplayStyle.RealisticWithEdges
Realistic With Edges

Autodesk.Revit.DB.DisplayStyle.FlatColors
Flat Colors

Autodesk.Revit.DB.DisplayStyle.Realistic
Realistic

Autodesk.Revit.DB.DisplayStyle.Rendering
Rendering

Autodesk.Revit.DB.DisplayStyle.ShadingWithEdges
Shading With Edges

Autodesk.Revit.DB.DisplayStyle.Shading
Shading

Autodesk.Revit.DB.DisplayStyle.HLR
Hidden Line Removal

Autodesk.Revit.DB.DisplayStyle.Wireframe
Wireframe

Autodesk.Revit.DB.DisplayStyle.Undefined
View does not use Render Type